cfe llm/Catalogs/AI_МестаЗапускаСценариев.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>AI_МестаЗапускаСценариев</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Активно</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сценарий</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.AI_Сценарии</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипМеста</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПолноеИмяМетаданных</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредставлениеКоманды</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Comment /><Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
					<FillFromFillingValue>false</FillFromFillingValue>				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачальныйЗапрос</Name>
					<Comment /><Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
					<FillFromFillingValue>false</FillFromFillingValue>				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Порядок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РазрешитьНесколькоОбъектов</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КартаИзвлечения</Name>
					<Type>
						<v8:Type>d5p1:CatalogRef.AI_КартыИзвлечения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидДействия</Name>
					<Type>
						<v8:Type>d5p1:EnumRef.AI_ВидДействия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КлючДействия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Обработчик</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МетодДействия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>64</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МетодПроверки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>64</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РежимВыполнения</Name>
					<Type>
						<v8:Type>d5p1:EnumRef.AI_РежимВыполнения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Уточнения</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Идентификатор</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Представление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидУточнения</Name>
							<Type>
								<v8:Type>d5p1:EnumRef.AI_ВидУточнения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИсточникДанных</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РеквизитСвязи</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РеквизитПредставления</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РеквизитСодержимого</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РеквизитИмениФайла</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОтборРеквизит</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОтборЗначение</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПередаватьСодержимое</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Обязательное</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Подсказка</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ОтборыКонтекста</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ПутьРеквизита</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидСравнения</Name>
							<Type>
								<v8:Type>d5p1:EnumRef.AI_ВидСравненияОтбора</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПараметрыДействия</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Имя</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипЗначения</Name>
							<Type>
								<v8:Type>d5p1:EnumRef.AI_ТипЗначенияПоля</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>500</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипСсылки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

cfe llm/Catalogs/AI_КартыИзвлечения.xml
<?xml version="1.0" encoding="utf-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>AI_КартыИзвлечения</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Активна</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПолноеИмяМетаданных</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Поля</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Ключ</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Представление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипЗначения</Name>
							<Type>
								<v8:Type>d5p1:EnumRef.AI_ТипЗначенияПоля</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипСсылки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПутьРеквизита</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПоискПоНаименованию</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Обязательное</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Подсказка</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

cfe llm/CommonModules/AI_Инструкции/Ext/Module.bsl
// Формирование инструкции по настроенным действиям помощника.
//
// Инструкция собирается из данных, а не пишется руками: что настроено в
// справочниках — то и попадает в документ. Поэтому она не расходится с
// системой и годится и пользователю, и тому, кто принимает настройку.
//
// Результат — самодостаточный HTML: стили внутри, внешних ссылок нет,
// файл открывается где угодно и переживает пересылку почтой.

#Область ПрограммныйИнтерфейс

// Возвращает HTML-инструкцию по настройке подсистемы.
//
// ТолькоАктивные — Булево - не показывать выключенные места запуска.
Функция СформироватьHTML(ТолькоАктивные = Истина) Экспорт

	Текст = Новый ТекстовыйДокумент;
	Текст.ДобавитьСтроку("<!DOCTYPE html>");
	Текст.ДобавитьСтроку("<html lang=""ru""><head><meta charset=""utf-8"">");
	Текст.ДобавитьСтроку("<title>AI-помощник: настроенные действия</title>");
	Текст.ДобавитьСтроку(Стили());
	Текст.ДобавитьСтроку("</head><body>");

	Текст.ДобавитьСтроку("<h1>AI-помощник: настроенные действия</h1>");
	Текст.ДобавитьСтроку(СтрШаблон(
		"<p class=""meta"">Сформировано %1. Конфигурация: %2, версия %3.</p>",
		Экранировать(Формат(ТекущаяДатаСеанса(), "ДЛФ=DT")),
		Экранировать(Метаданные.Синоним),
		Экранировать(Метаданные.Версия)));

	ДобавитьВведение(Текст);
	ДобавитьМестаЗапуска(Текст, ТолькоАктивные);
	ДобавитьКарты(Текст);

	Текст.ДобавитьСтроку("</body></html>");
	Возврат Текст.ПолучитьТекст();

КонецФункции

// Имя файла для сохранения, с датой — чтобы версии не перезаписывали друг друга.
Функция ИмяФайлаИнструкции() Экспорт

	Возврат "AI-помощник инструкция "
		+ Формат(ТекущаяДатаСеанса(), "ДФ=yyyy-MM-dd") + ".html";

КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ДобавитьВведение(Текст)

	Текст.ДобавитьСтроку("<h2>Как это работает</h2>");
	Текст.ДобавитьСтроку("<p>Помощник вызывается из карточки объекта и открывается"
		+ " окном поверх нее. Он показывает действия, доступные для этого объекта,"
		+ " задает уточняющие вопросы, обращается к модели и показывает"
		+ " результат. Что произойдет с результатом, задано настройкой действия.</p>");
	Текст.ДобавитьСтроку("<p>Модель ничего не меняет сама. Она возвращает значения,"
		+ " решение принимает человек: он отмечает нужные строки и подтверждает"
		+ " действие. Текст подтверждения прямо говорит, будет объект записан"
		+ " или нет.</p>");

	Текст.ДобавитьСтроку("<h3>Виды действия с результатом</h3>");
	Текст.ДобавитьСтроку("<table><tr><th>Вид</th><th>Что происходит</th></tr>");
	Текст.ДобавитьСтроку("<tr><td>Только показать</td><td>Ничего. Значения показаны,"
		+ " кнопка действия скрыта.</td></tr>");
	Текст.ДобавитьСтроку("<tr><td>Заполнить форму</td><td>Значения переносятся в"
		+ " открытую форму объекта. Объект не записывается — записывает"
		+ " человек.</td></tr>");
	Текст.ДобавитьСтроку("<tr><td>Записать объект</td><td>Значения записываются в"
		+ " объект. Запись минует форму, а значит и проверки модуля формы.</td></tr>");
	Текст.ДобавитьСтроку("<tr><td>Пользовательское действие</td><td>Выполняется"
		+ " прикладной код конфигурации.</td></tr>");
	Текст.ДобавитьСтроку("<tr><td>Внешний обработчик</td><td>Выполняется внешняя"
		+ " обработка из реестра дополнительных обработок.</td></tr>");
	Текст.ДобавитьСтроку("</table>");

КонецПроцедуры

Процедура ДобавитьМестаЗапуска(Текст, ТолькоАктивные)

	Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	Места.Ссылка КАК Ссылка,
		|	Места.Код КАК Код,
		|	Места.Наименование КАК Наименование,
		|	Места.ПредставлениеКоманды КАК ПредставлениеКоманды,
		|	Места.Описание КАК Описание,
		|	Места.НачальныйЗапрос КАК НачальныйЗапрос,
		|	Места.Активно КАК Активно,
		|	Места.ТипМеста КАК ТипМеста,
		|	Места.ПолноеИмяМетаданных КАК ПолноеИмяМетаданных,
		|	Места.ВидДействия КАК ВидДействия,
		|	Места.Обработчик КАК Обработчик,
		|	Места.МетодДействия КАК МетодДействия,
		|	Места.МетодПроверки КАК МетодПроверки,
		|	Места.КлючДействия КАК КлючДействия,
		|	Места.КартаИзвлечения КАК КартаИзвлечения,
		|	Места.Сценарий КАК Сценарий
		|ИЗ
		|	Справочник.AI_МестаЗапускаСценариев КАК Места
		|ГДЕ
		|	НЕ Места.ПометкаУдаления
		|	И (НЕ &ТолькоАктивные ИЛИ Места.Активно)
		|УПОРЯДОЧИТЬ ПО
		|	Места.Порядок, Места.Наименование");
	Запрос.УстановитьПараметр("ТолькоАктивные", ТолькоАктивные);
	Выборка = Запрос.Выполнить().Выбрать();

	Текст.ДобавитьСтроку("<h2>Настроенные действия</h2>");
	Если Не Выборка.Следующий() Тогда
		Текст.ДобавитьСтроку("<p class=""empty"">Действия не настроены.</p>");
		Возврат;
	КонецЕсли;

	Выборка.Сбросить();
	Пока Выборка.Следующий() Цикл
		Заголовок = ?(ЗначениеЗаполнено(Выборка.ПредставлениеКоманды),
			Выборка.ПредставлениеКоманды, Выборка.Наименование);
		Текст.ДобавитьСтроку(СтрШаблон("<h3>%1 <span class=""code"">%2</span>%3</h3>",
			Экранировать(Заголовок),
			Экранировать(Выборка.Код),
			?(Выборка.Активно, "", " <span class=""off"">выключено</span>")));

		Если ЗначениеЗаполнено(Выборка.Описание) Тогда
			Текст.ДобавитьСтроку("<p>" + Экранировать(Выборка.Описание) + "</p>");
		КонецЕсли;

		Текст.ДобавитьСтроку("<table class=""props"">");
		ДобавитьСтрокуСвойства(Текст, "Где доступно", ГдеДоступно(Выборка));
		ДобавитьСтрокуСвойства(Текст, "Сценарий", Строка(Выборка.Сценарий));
		ДобавитьСтрокуСвойства(Текст, "Что делает с результатом",
			Строка(Выборка.ВидДействия));
		Если ЗначениеЗаполнено(Выборка.Обработчик) Тогда
			ДобавитьСтрокуСвойства(Текст, "Обработка", Выборка.Обработчик);
			ДобавитьСтрокуСвойства(Текст, "Метод действия",
				?(ЗначениеЗаполнено(Выборка.МетодДействия),
					Выборка.МетодДействия, "ВыполнитьДействие"));
			Если ЗначениеЗаполнено(Выборка.МетодПроверки) Тогда
				ДобавитьСтрокуСвойства(Текст, "Метод проверки", Выборка.МетодПроверки);
			КонецЕсли;
		КонецЕсли;
		Если ЗначениеЗаполнено(Выборка.КлючДействия) Тогда
			ДобавитьСтрокуСвойства(Текст, "Ключ действия", Выборка.КлючДействия);
		КонецЕсли;
		Если ЗначениеЗаполнено(Выборка.КартаИзвлечения) Тогда
			ДобавитьСтрокуСвойства(Текст, "Карта извлечения",
				Строка(Выборка.КартаИзвлечения));
		КонецЕсли;
		Текст.ДобавитьСтроку("</table>");

		ДобавитьУточнения(Текст, Выборка.Ссылка);
		ДобавитьПараметрыДействия(Текст, Выборка.Ссылка);

		Если ЗначениеЗаполнено(Выборка.НачальныйЗапрос) Тогда
			Текст.ДобавитьСтроку("<p class=""label"">Запрос к модели</p>");
			Текст.ДобавитьСтроку("<pre>" + Экранировать(Выборка.НачальныйЗапрос) + "</pre>");
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры

Функция ГдеДоступно(Выборка)

	Тип = СокрЛП(Строка(Выборка.ТипМеста));
	Если Тип = "Глобально" Тогда
		Возврат "В разделе, без привязки к объекту";
	КонецЕсли;
	Имя = СокрЛП(Выборка.ПолноеИмяМетаданных);
	Если Не ЗначениеЗаполнено(Имя) Или Имя = "*" Тогда
		Возврат "Любой объект (" + Тип + ")";
	КонецЕсли;
	Описание = Метаданные.НайтиПоПолномуИмени(Имя);
	Если Описание = Неопределено Тогда
		Возврат Имя + " (в конфигурации не найден)";
	КонецЕсли;
	Возврат Описание.Синоним + " (" + Имя + ")";

КонецФункции

Процедура ДобавитьУточнения(Текст, МестоЗапуска)

	Уточнения = МестоЗапуска.Уточнения;
	Если Уточнения.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;

	Текст.ДобавитьСтроку("<p class=""label"">О чем спросит помощник</p>");
	Текст.ДобавитьСтроку("<table><tr><th>Шаг</th><th>Что спрашивает</th>"
		+ "<th>Как отвечать</th><th>Обязательно</th></tr>");
	Номер = 0;
	Для Каждого Строка Из Уточнения Цикл
		Номер = Номер + 1;
		Вопрос = ?(ЗначениеЗаполнено(Строка.Подсказка),
			Строка.Подсказка,
			?(ЗначениеЗаполнено(Строка.Представление),
				Строка.Представление, "Уточнение " + Формат(Номер, "ЧГ=0")));
		Текст.ДобавитьСтроку(СтрШаблон("<tr><td>%1</td><td>%2</td><td>%3</td><td>%4</td></tr>",
			Номер,
			Экранировать(Вопрос),
			Экранировать(Строка(Строка.ВидУточнения)),
			?(Строка.Обязательное, "да", "нет")));
	КонецЦикла;
	Текст.ДобавитьСтроку("</table>");

КонецПроцедуры

Процедура ДобавитьПараметрыДействия(Текст, МестоЗапуска)

	Параметры = МестоЗапуска.ПараметрыДействия;
	Если Параметры.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;

	Текст.ДобавитьСтроку("<p class=""label"">Параметры действия</p>");
	Текст.ДобавитьСтроку("<table><tr><th>Имя</th><th>Тип</th><th>Значение</th></tr>");
	Для Каждого Строка Из Параметры Цикл
		Текст.ДобавитьСтроку(СтрШаблон("<tr><td>%1</td><td>%2</td><td>%3</td></tr>",
			Экранировать(Строка.Имя),
			Экранировать(Строка(Строка.ТипЗначения)),
			Экранировать(Строка.Значение)));
	КонецЦикла;
	Текст.ДобавитьСтроку("</table>");

КонецПроцедуры

Процедура ДобавитьКарты(Текст)

	Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	Карты.Ссылка КАК Ссылка,
		|	Карты.Наименование КАК Наименование,
		|	Карты.Описание КАК Описание,
		|	Карты.ПолноеИмяМетаданных КАК ПолноеИмяМетаданных
		|ИЗ
		|	Справочник.AI_КартыИзвлечения КАК Карты
		|ГДЕ
		|	НЕ Карты.ПометкаУдаления И Карты.Активна
		|УПОРЯДОЧИТЬ ПО
		|	Карты.Наименование");
	Выборка = Запрос.Выполнить().Выбрать();
	Если Не Выборка.Следующий() Тогда
		Возврат;
	КонецЕсли;
	Выборка.Сбросить();

	Текст.ДобавитьСтроку("<h2>Какие реквизиты извлекаются</h2>");
	Текст.ДобавитьСтроку("<p>Карта извлечения — белый список: помощник может"
		+ " предложить только те реквизиты, которые в ней перечислены.</p>");

	Пока Выборка.Следующий() Цикл
		Текст.ДобавитьСтроку("<h3>" + Экранировать(Выборка.Наименование) + "</h3>");
		Если ЗначениеЗаполнено(Выборка.Описание) Тогда
			Текст.ДобавитьСтроку("<p>" + Экранировать(Выборка.Описание) + "</p>");
		КонецЕсли;
		Текст.ДобавитьСтроку("<table><tr><th>Реквизит</th><th>Тип</th>"
			+ "<th>Куда попадает</th><th>Обязательный</th><th>Подсказка модели</th></tr>");
		Для Каждого Поле Из Выборка.Ссылка.Поля Цикл
			Текст.ДобавитьСтроку(СтрШаблон(
				"<tr><td>%1</td><td>%2</td><td class=""code"">%3</td><td>%4</td><td>%5</td></tr>",
				Экранировать(?(ЗначениеЗаполнено(Поле.Представление),
					Поле.Представление, Поле.Ключ)),
				Экранировать(Строка(Поле.ТипЗначения)),
				Экранировать(Поле.ПутьРеквизита),
				?(Поле.Обязательное, "да", "нет"),
				Экранировать(Поле.Подсказка)));
		КонецЦикла;
		Текст.ДобавитьСтроку("</table>");
	КонецЦикла;

КонецПроцедуры

Процедура ДобавитьСтрокуСвойства(Текст, Имя, Значение)

	Если Не ЗначениеЗаполнено(Значение) Тогда
		Возврат;
	КонецЕсли;
	Текст.ДобавитьСтроку(СтрШаблон("<tr><th>%1</th><td>%2</td></tr>",
		Экранировать(Имя),
		Экранировать(Значение)));

КонецПроцедуры

// Данные попадают в разметку, поэтому экранируются всегда: наименование
// сценария вполне может содержать кавычки или угловые скобки.
Функция Экранировать(Значение)

	Результат = Строка(Значение);
	Результат = СтрЗаменить(Результат, "&", "&amp;");
	Результат = СтрЗаменить(Результат, "<", "&lt;");
	Результат = СтрЗаменить(Результат, ">", "&gt;");
	Результат = СтрЗаменить(Результат, """", "&quot;");
	Возврат Результат;

КонецФункции

Функция Стили()

	Возврат "<style>
		|body{font:15px/1.55 -apple-system,'Segoe UI',Roboto,sans-serif;
		|color:#1d1d1f;max-width:900px;margin:32px auto;padding:0 20px}
		|h1{font-size:26px;margin:0 0 4px}
		|h2{font-size:20px;margin:32px 0 10px;padding-top:14px;border-top:1px solid #e3e3e6}
		|h3{font-size:16px;margin:22px 0 8px}
		|p{margin:8px 0}
		|.meta{color:#6e6e73;font-size:13px;margin-bottom:8px}
		|.empty{color:#6e6e73}
		|.label{font-weight:600;margin:14px 0 6px}
		|.off{color:#b8352c;font-weight:400;font-size:13px}
		|.code,td.code{font-family:Consolas,'SF Mono',monospace;font-size:13px;color:#4a4a52}
		|table{border-collapse:collapse;width:100%;margin:6px 0 10px}
		|th,td{border:1px solid #e3e3e6;padding:6px 9px;text-align:left;vertical-align:top}
		|th{background:#f6f6f8;font-weight:600}
		|table.props th{width:230px}
		|pre{background:#f6f6f8;border:1px solid #e3e3e6;padding:10px;
		|white-space:pre-wrap;font-size:13px;margin:6px 0 10px}
		|</style>";

КонецФункции

#КонецОбласти
